# Topic 1 : Introduction to Pandas - Series & DataFrames

In [1]:
import numpy as np
import pandas as pd

## Task 1

In [2]:
arr=  [1,2,3,4]

df=pd.Series(arr, index=["A", "B", "C", "D"])
df

A    1
B    2
C    3
D    4
dtype: int64

## Task  2

In [3]:
arr=  [100,20,30,40]

df=pd.Series(arr, index=["A", "B", "C", "D"])
df.mean()
df.min()
df.max()

np.int64(100)

## Task 3

In [4]:
arr = np.array([10, 20, 30, 40, 50])
df=pd.Series(arr)
df+5
df-5
df*10
df/10

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

## Task 4

In [5]:
student = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [20, 21, 19, 22],
    'Marks': [85, 90, 78, 92]
}
df=pd.DataFrame(student)
df

      Name  Age  Marks
0    Alice   20     85
1      Bob   21     90
2  Charlie   19     78
3    Diana   22     92

## Task 5

In [6]:
student = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [20, 21, 19, 22],
    'Marks': [85, 90, 78, 92]
}
df=pd.DataFrame(student)
df.columns
df.dtypes
df["Age"].mean()
df["Age"].std()
df["Age"].median()
df["Age"].var()

np.float64(1.6666666666666667)

## Task 6

In [7]:
date_series = pd.Series(['2025-04-16', '2024-12-25', '2023-01-01', '2022-07-04'])
date_series
date=pd.to_datetime(date_series)
date
years=date.dt.year.tolist()
months=date.dt.month.tolist()
day=date.dt.day.tolist()
df=pd.DataFrame({
    "years": years,
    "months": months,
    "day": day
})
df

   years  months  day
0   2025       4   16
1   2024      12   25
2   2023       1    1
3   2022       7    4

## Task 7

In [8]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace'],
    'Age': [20, 21, 19, 22, 23, 20, 24],
    'Marks': [85, 90, 78, 92, 88, 75, 80],
    'Gender': ['F', 'M', 'M', 'F', 'F', 'M', 'F'],
    'Grade': ['A', 'A', 'B', 'A', 'B', 'C', 'B']
}

df = pd.DataFrame(data)

df.iloc[:,:3]
df.tail(5)
# first 3 cols and last 5 rows
df.iloc[-5:,:3]

      Name  Age  Marks
2  Charlie   19     78
3    Diana   22     92
4      Eve   23     88
5    Frank   20     75
6    Grace   24     80

# Task 8

In [9]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace'],
    'Age': [20, 21, 19, 22, 23, 20, 24],
    'Marks': [85, 90, 78, 92, 88, 75, 80],
    'Gender': ['F', 'M', 'M', 'F', 'F', 'M', 'F'],
    'Grade': ['A', 'A', 'B', 'A', 'B', 'C', 'B']
}

df = pd.DataFrame(data)
df["AgeMarks"] = df["Age"]+df["Marks"]
df

      Name  Age  Marks Gender Grade  AgeMarks
0    Alice   20     85      F     A       105
1      Bob   21     90      M     A       111
2  Charlie   19     78      M     B        97
3    Diana   22     92      F     A       114
4      Eve   23     88      F     B       111
5    Frank   20     75      M     C        95
6    Grace   24     80      F     B       104

## Task 9

In [13]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace'],
    'Age': [20, 21, 19, 22, 23, 20, 24],
    'Marks': [85, 90, 78, 92, 88, 75, 80],
    'Gender': ['F', 'M', 'M', 'F', 'F', 'M', 'F'],
    'Grade': ['A', 'A', 'B', 'A', 'B', 'C', 'B']
}

df = pd.DataFrame(data)
df=df.rename(columns={
    "Name": "A",
    "Age": "B",
    "Marks": "C",
    "Gender": "D",
    "Grade": "E"
})
df.index=list(range(6,13))
df

          A   B   C  D  E
6     Alice  20  85  F  A
7       Bob  21  90  M  A
8   Charlie  19  78  M  B
9     Diana  22  92  F  A
10      Eve  23  88  F  B
11    Frank  20  75  M  C
12    Grace  24  80  F  B

## Task 10

In [17]:
categories = pd.Series(['apple', 'banana', 'apple', 'orange', 'banana', 'apple'])
categories
labels, unique=categories.factorize()
labels, unique

## uisng astype
categories = pd.Series(['apple', 'banana', 'apple', 'orange', 'banana', 'apple'])
categories=categories.astype("category").cat.codes
categories

0    0
1    1
2    0
3    2
4    1
5    0
dtype: int8

## Task 11

In [20]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [20, 21, 19, 22],
    'Marks': [85, 90, 78, 92]
}

df = pd.DataFrame(data)
df
df_without_marks=df.drop(columns=["Marks"])
df_without_marks
df_without_first_row=df.drop(index=0)
df_without_first_row

      Name  Age  Marks
1      Bob   21     90
2  Charlie   19     78
3    Diana   22     92

## Task 12

In [22]:
data = {
    'Name': ['Alice', 'Bob', None, 'Diana'],
    'Age': [20, None, 19, 22],
    'Marks': [85, 90, None, 92]
}

df = pd.DataFrame(data)
df
def missing_values(df):
    return df.isnull().sum()

missing_values(df)

Name     1
Age      1
Marks    1
dtype: int64